Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/МероприятияТрудовойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>МероприятияТрудовойДеятельности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаМероприятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидМероприятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМероприятийТрудовойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РазрядКатегорияДолжности</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоРееструДолжностей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудоваяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеФункции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеУвольнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУвольнения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяСовместителем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияТекстОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияСтатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияЧасть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияПодПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдМероприятия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыМероприятийТрудовойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыМероприятийТрудовойДеятельности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переименование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановлениеВторойПрофессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретЗаниматьДолжность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники/Forms/РегистрацияТрудовойДеятельности/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,
		Параметры,
		"ФизическоеЛицоСсылка, ТекущаяОрганизация, ТекущееПодразделение,
		|ТекущаяДолжность, ТекущийВидЗанятости, ДатаПриема, ДатаУвольнения");
	
	ДополнительныеПараметрыОткрытия = ПолучитьИзВременногоХранилища(Параметры.АдресДополнительныхПараметров);
	ЗначениеВРеквизитФормы(ДополнительныеПараметрыОткрытия.Сотрудник, "Сотрудник");
	
	Если Параметры.Прием Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Прием на работу (%1)'"), ФизическоеЛицоСсылка.ФИО);
	ИначеЕсли Параметры.Увольнение Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Увольнение (%1)'"), ФизическоеЛицоСсылка.ФИО);
	ИначеЕсли Параметры.Перевод Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Перевод (%1)'"), ФизическоеЛицоСсылка.ФИО);
		ДатаПеревода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДатаПриказа    = ТекущаяДатаСеанса();
	
	НаименованиеДокумента = НСтр("ru='Приказ'");
	СтатьяТКРФ            = Справочники.ОснованияУвольнения.Статья77п3;
	ОпределитьТрудовуюФункцию();
	
	ЗаполнятьПодразделения =
		Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяОрганизация,
			"НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности");
	
	Элементы.ГруппаПриемПеревод.Видимость = Параметры.Прием ИЛИ Параметры.Перевод;
	Элементы.ДатаПриема.Видимость         = Параметры.Прием;
	Элементы.ДатаПеревода.Видимость       = Параметры.Перевод;
	Элементы.ГруппаУвольнение.Видимость   = Параметры.Увольнение;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ТекущееПодразделение",
		"Видимость",
		ЗаполнятьПодразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Параметры.Увольнение Тогда
		ИндексРеквизита = ПроверяемыеРеквизиты.Найти("СтатьяТКРФ");
		ПроверяемыеРеквизиты.Удалить(ИндексРеквизита);
	КонецЕсли;
	
	Если НЕ Параметры.Перевод Тогда
		ИндексРеквизита = ПроверяемыеРеквизиты.Найти("ДатаПеревода");
		ПроверяемыеРеквизиты.Удалить(ИндексРеквизита);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		СохранитьИЗакрытьНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеДокументаПриИзменении(Элемент)
	
	Если Параметры.Прием Тогда
		ВидДокумента = "ПриемНаРаботу";
	Иначе
		ВидДокумента = "Увольнение";
	КонецЕсли;
	
	ЭлектронныеТрудовыеКнижкиКлиент.НаименованиеДокументаПриИзменении(ТекущаяОрганизация,
		ВидДокумента,
		НаименованиеДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЭлектронныеТрудовыеКнижкиКлиент.НаименованиеДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЭлектронныеТрудовыеКнижкиКлиент.НаименованиеДокументаОбработкаВыбора(
		НаименованиеДокумента, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЭлектронныеТрудовыеКнижкиКлиент.НаименованиеДокументаАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗанятостиПриИзменении(Элемент)
	
	СотрудникиКлиент.ПроверитьКонфликтыВидаЗанятостиССуществующимиСотрудниками(
		Сотрудник.Ссылка,
		ФизическоеЛицоСсылка,
		ТекущаяОрганизация,
		ТекущийВидЗанятости,
		ДатаПриема);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяДолжностьПриИзменении(Элемент)
	
	ОпределитьТрудовуюФункцию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиенте()
	
	ЗарегистрироватьМероприятиеТрудовойДеятельности();
	Модифицированность = Ложь;
	Закрыть(МероприятиеТрудовойДеятельности);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Результат, ДополнительныеПараметры) Экспорт 
	
	СохранитьИЗакрытьНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТрудовуюФункцию()
	
	Если ЗначениеЗаполнено(ТекущаяДолжность) Тогда
		
		ТрудоваяФункция = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяДолжность, "ТрудоваяФункция");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьМероприятиеТрудовойДеятельности()
	
	РегистрацияТрудовойДеятельности = Документы.РегистрацияТрудовойДеятельности.СоздатьДокумент();
	РегистрацияТрудовойДеятельности.Дата = ТекущаяДатаСеанса();
	РегистрацияТрудовойДеятельности.Организация = ТекущаяОрганизация;
	
	Если Параметры.Прием Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",           ТекущаяОрганизация);
		Запрос.УстановитьПараметр("Сотрудник",             Сотрудник.Ссылка);
		Запрос.УстановитьПараметр("ФизическоеЛицо",        ФизическоеЛицоСсылка);
		Запрос.УстановитьПараметр("ЯвляетсяСовместителем", ТекущийВидЗанятости <> Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
		Запрос.УстановитьПараметр("ВидМероприятия",        Перечисления.ВидыМероприятийТрудовойДеятельности.Прием);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МероприятияТрудовойДеятельности.ИдМероприятия КАК ИдМероприятия
		|ПОМЕСТИТЬ ВТ_ОтмененныеМероприятия
		|ИЗ
		|	РегистрСведений.МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
		|ГДЕ
		|	МероприятияТрудовойДеятельности.Организация = &Организация
		|	И МероприятияТрудовойДеятельности.ФизическоеЛицо = &ФизическоеЛицо
		|	И МероприятияТрудовойДеятельности.Сотрудник = &Сотрудник
		|	И МероприятияТрудовойДеятельности.ЯвляетсяСовместителем = &ЯвляетсяСовместителем
		|	И МероприятияТрудовойДеятельности.ВидМероприятия = &ВидМероприятия
		|	И МероприятияТрудовойДеятельности.Отменено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
		|ГДЕ
		|	МероприятияТрудовойДеятельности.Организация = &Организация
		|	И МероприятияТрудовойДеятельности.ФизическоеЛицо = &ФизическоеЛицо
		|	И МероприятияТрудовойДеятельности.Сотрудник = &Сотрудник
		|	И МероприятияТрудовойДеятельности.ЯвляетсяСовместителем = &ЯвляетсяСовместителем
		|	И МероприятияТрудовойДеятельности.ВидМероприятия = &ВидМероприятия
		|	И НЕ МероприятияТрудовойДеятельности.Отменено
		|	И НЕ МероприятияТрудовойДеятельности.ИдМероприятия В
		|				(ВЫБРАТЬ
		|					ВТ_ОтмененныеМероприятия.ИдМероприятия
		|				ИЗ
		|					ВТ_ОтмененныеМероприятия)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МероприятияТрудовойДеятельности.Регистратор";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НоваяСтрока = РегистрацияТрудовойДеятельности.Мероприятия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.СотрудникЗаписи = Сотрудник.Ссылка;
			НоваяСтрока.ДатаОтмены      = РегистрацияТрудовойДеятельности.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрока = РегистрацияТрудовойДеятельности.Мероприятия.Добавить();
	
	НоваяСтрока.Сотрудник                      = ФизическоеЛицоСсылка;
	НоваяСтрока.НаименованиеДокументаОснования = НаименованиеДокумента;
	НоваяСтрока.ДатаДокументаОснования         = ДатаПриказа;
	НоваяСтрока.НомерДокументаОснования        = НомерПриказа;
	НоваяСтрока.ЯвляетсяСовместителем          = ТекущийВидЗанятости <> Перечисления.ВидыЗанятости.ОсновноеМестоРаботы;
	НоваяСтрока.СотрудникЗаписи                = Сотрудник.Ссылка;
	НоваяСтрока.ИдМероприятия                  = Новый УникальныйИдентификатор;
	
	Если Параметры.Прием ИЛИ Параметры.Перевод Тогда
		Если Параметры.Прием Тогда
			НоваяСтрока.ДатаМероприятия = ДатаПриема;
			НоваяСтрока.ВидМероприятия  = Перечисления.ВидыМероприятийТрудовойДеятельности.Прием;
		Иначе
			НоваяСтрока.ДатаМероприятия = ДатаПеревода;
			НоваяСтрока.ВидМероприятия  = Перечисления.ВидыМероприятийТрудовойДеятельности.Перевод;
		КонецЕсли;
		НоваяСтрока.Подразделение   = ТекущееПодразделение;
		НоваяСтрока.Должность       = ТекущаяДолжность;
		НоваяСтрока.ТрудоваяФункция = ТрудоваяФункция;
		
		Если ЗначениеЗаполнено(ТекущееПодразделение) Тогда
			НоваяСтрока.ПредставлениеПодразделения =
				ЭлектронныеТрудовыеКнижкиПовтИсп.ПредставлениеПодразделения(ТекущееПодразделение);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущаяДолжность) Тогда
			СвойстваДолжности = ЭлектронныеТрудовыеКнижкиПовтИсп.СвойстваДолжности(ТекущаяДолжность);
			НоваяСтрока.ПредставлениеДолжности = СвойстваДолжности.Представление;
			НоваяСтрока.КодПоРееструДолжностей = СвойстваДолжности.КодПоРееструДолжностей;
		КонецЕсли;
		
	Иначе
		НоваяСтрока.ДатаМероприятия = ДатаУвольнения;
		НоваяСтрока.ВидМероприятия = Перечисления.ВидыМероприятийТрудовойДеятельности.Увольнение;
		НоваяСтрока.ОснованиеУвольнения = СтатьяТКРФ;
		Если ЗначениеЗаполнено(СтатьяТКРФ) Тогда
			СвойстваОснованияУвольнения = ЭлектронныеТрудовыеКнижкиПовтИсп.СвойстваОснованияУвольнения(СтатьяТКРФ);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СвойстваОснованияУвольнения);
		КонецЕсли;
	КонецЕсли;
	
	РегистрацияТрудовойДеятельности.Записать(РежимЗаписиДокумента.Проведение);
	
	МероприятиеТрудовойДеятельности = РегистрацияТрудовойДеятельности.Ссылка;
	
КонецПроцедуры

#КонецОбласти
